TOKEN_API = '7788128544:AAGzp06XFM2nfGsA-9wci6l7IQV2JuejqUs'

START_TEXT = ''' Я твой бот-помощник для изучения космоса!
Выберите, какую тему вы бы хотели изучить:'''

# Словарь для хранения путей к изображениям планет
image_dict = {
    'mars': 'image/planet/mars.png',
    'earth': 'image/planet/earth.png',
    'jupiter': 'image/planet/jupiter.png',
    'merkury': 'image/planet/merkury.png',
    'neptune': 'image/planet/neptune.png',
    'plutonium': 'image/planet/plutonium.png',
    'saturn': 'image/planet/saturn.png',
    'uran': 'image/planet/uran.png',
    'venus': 'image/planet/venus.png'
}

# Словарь для хранения путей к изображениям астронавтов
astronauts_dict = {}

# Словарь для хранения путей к изображениям спутников
satellites_dict = {}

# Описание планет
MERKURY_DESCRIPTION = '''
Меркурий
Ближайшая к Солнцу планета, покрытая кратерами. 
У него почти нет атмосферы, а температура колеблется от экстремально высокой днём до очень низкой ночью.
'''

VENUS_DESCRIPTION = '''
Венера
Вторая планета от Солнца, известная своей плотной токсичной атмосферой из углекислого газа и облаков серной кислоты. 
Температура здесь выше, чем на Меркурии, из-за сильного парникового эффекта.
'''

EARTH_DESCRIPTION = '''
Земля
Третья планета, единственная известная с жидкой водой и жизнью. 
Имеет разнообразный климат, тектоническую активность и мощное магнитное поле.'''

MARS_DESCRIPTION = ''' 
Марс
"Красная планета" с пыльной поверхностью, тонкой атмосферой и следами древней воды. 
На Марсе есть вулканы, каньоны и полярные ледяные шапки.'''

JUPITER_DESCRIPTION = ''' 
Юпитер
Крупнейшая планета Солнечной системы – газовый гигант, состоящий в основном из водорода и гелия. 
Известен Большим Красным Пятном (гигантским штормом) и множеством спутников.
'''

SATURN_DESCRIPTION = ''' 
Сатурн
Шестая планета, знаменитая своими кольцами из льда и камня. 
Как и Юпитер, это газовый гигант с многочисленными спутниками, включая Титан с плотной атмосферой.'''

URAN_DESCRIPTION = ''' 
Уран
Ледяной гигант с необычным наклоном оси (почти на бок). 
Состоит из воды, аммиака и метана, придающего ему голубоватый оттенок.'''

NEPTUN_DESCRIPTION = ''' 
Нептун
Самый далёкий газовый гигант, известный сильнейшими ветрами в Солнечной системе. 
Как и Уран, содержит много льдов и имеет голубой цвет из-за метана.'''

PLUTONIUM_DESCRIPTION = '''
Плутон (карликовая планета)
Небольшое ледяное тело в поясе Койпера, когда-то считавшееся девятой планетой.
'''
